# DockablePaneState Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePaneState Class
Members See Also
---
Describes where a dockable pane window should appear in the Revit user interface.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class DockablePaneState : IDisposable
```

Visual Basic
---
```text
Public Class DockablePaneState _
	Implements IDisposable
```

Visual C++
---
```text
public ref class DockablePaneState : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..DockablePaneState
# See Also
DockablePaneState Members
Autodesk.Revit.UI Namespace